; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-98)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b17)
    (on b17 b18)
    (on b18 b22)
    (on b22 b21)
    (on-table b21)
    (clear b4)
    (on b4 b23)
    (on b23 b14)
    (on b14 b16)
    (on b16 b2)
    (on-table b2)
    (clear b13)
    (on b13 b7)
    (on b7 b11)
    (on b11 b9)
    (on b9 b27)
    (on b27 b25)
    (on b25 b3)
    (on-table b3)
    (clear b1)
    (on b1 b24)
    (on b24 b5)
    (on b5 b12)
    (on b12 b6)
    (on b6 b19)
    (on b19 b10)
    (on b10 b20)
    (on b20 b26)
    (on-table b26)
    (clear b28)
    (on b28 b8)
    (on b8 b29)
    (on-table b29))
 (:goal (and 
(on-table b1)
(on-table b8)
(on b7 b1)
(on b24 b8)
(on b5 b7)
(on b11 b24)
(on b21 b11)
))
)

; plan
1. (unstack b1 b24)
   deleted: (on b1 b24) (clear b1) (arm-empty)
   added: (holding b1) (clear b24)
   goals met: 0 of 7
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 7
3. (unstack b28 b8)
   deleted: (on b28 b8) (clear b28) (arm-empty)
   added: (holding b28) (clear b8)
   goals met: 1 of 7
4. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 7
5. (unstack b8 b29)
   deleted: (on b8 b29) (clear b8) (arm-empty)
   added: (holding b8) (clear b29)
   goals met: 1 of 7
6. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 7
7. (unstack b24 b5)
   deleted: (on b24 b5) (clear b24) (arm-empty)
   added: (holding b24) (clear b5)
   goals met: 2 of 7
8. (stack b24 b8)
   deleted: (clear b8) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b8)
   goals met: 3 of 7
9. (unstack b13 b7)
   deleted: (on b13 b7) (clear b13) (arm-empty)
   added: (holding b13) (clear b7)
   goals met: 3 of 7
10. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 3 of 7
11. (unstack b7 b11)
   deleted: (on b7 b11) (clear b7) (arm-empty)
   added: (holding b7) (clear b11)
   goals met: 3 of 7
12. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 4 of 7
13. (unstack b11 b9)
   deleted: (on b11 b9) (clear b11) (arm-empty)
   added: (holding b11) (clear b9)
   goals met: 4 of 7
14. (stack b11 b24)
   deleted: (clear b24) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b24)
   goals met: 5 of 7
15. (unstack b5 b12)
   deleted: (on b5 b12) (clear b5) (arm-empty)
   added: (holding b5) (clear b12)
   goals met: 5 of 7
16. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 6 of 7
17. (unstack b15 b17)
   deleted: (on b15 b17) (clear b15) (arm-empty)
   added: (holding b15) (clear b17)
   goals met: 6 of 7
18. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 6 of 7
19. (unstack b17 b18)
   deleted: (on b17 b18) (clear b17) (arm-empty)
   added: (holding b17) (clear b18)
   goals met: 6 of 7
20. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 6 of 7
21. (unstack b18 b22)
   deleted: (on b18 b22) (clear b18) (arm-empty)
   added: (holding b18) (clear b22)
   goals met: 6 of 7
22. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 6 of 7
23. (unstack b22 b21)
   deleted: (on b22 b21) (clear b22) (arm-empty)
   added: (holding b22) (clear b21)
   goals met: 6 of 7
24. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 6 of 7
25. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 6 of 7
26. (stack b21 b11)
   deleted: (clear b11) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b11)
   goals met: 7 of 7
